MikroElektronika/core_packages/ARM/gcc_clang/def/sam/ATSAMV70N20B/mcu.h
  PERIPH_COUNT_IRQn        = 70  /**< Number of peripheral IDs */
} IRQn_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct _DeviceVectors
{
  /* Stack pointer */
  void* pvStack;
  /* Cortex-M handlers */
  void* pfnReset_Handler;                        /* -15 Reset Vector, invoked on Power up and warm reset  */
  void* pfnNonMaskableInt_Handler;               /* -14 Non maskable Interrupt, cannot be stopped or preempted  */
  void* pfnHardFault_Handler;                    /* -13 Hard Fault, all classes of Fault     */
  void* pfnMemoryManagement_Handler;             /* -12 Memory Management, MPU mismatch, including Access Violation and No Match  */
  void* pfnBusFault_Handler;                     /* -11 Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault  */
  void* pfnUsageFault_Handler;                   /* -10 Usage Fault, i.e. Undef Instruction, Illegal State Transition  */
  void* pvReservedC9;
  void* pvReservedC8;
  void* pvReservedC7;
  void* pvReservedC6;
  void* pfnSVCall_Handler;                       /*  -5 System Service Call via SVC instruction  */
  void* pfnDebugMonitor_Handler;                 /*  -4 Debug Monitor                        */
  void* pvReservedC3;
  void* pfnPendSV_Handler;                       /*  -2 Pendable request for system service  */
  void* pfnSysTick_Handler;                      /*  -1 System Tick Timer                    */


  /* Peripheral handlers */
  void* pfnSUPC_Handler;                         /* 0   SAMV70N20B Supply Controller (SUPC) */
  void* pfnRSTC_Handler;                         /* 1   SAMV70N20B Reset Controller (RSTC) */
  void* pfnRTC_Handler;                          /* 2   SAMV70N20B Real-time Clock (RTC) */
  void* pfnRTT_Handler;                          /* 3   SAMV70N20B Real-time Timer (RTT) */
  void* pfnWDT_Handler;                          /* 4   SAMV70N20B Watchdog Timer (WDT) */
  void* pfnPMC_Handler;                          /* 5   SAMV70N20B Power Management Controller (PMC) */
  void* pfnEFC_Handler;                          /* 6   SAMV70N20B Embedded Flash Controller (EFC) */
  void* pfnUART0_Handler;                        /* 7   SAMV70N20B Universal Asynchronous Receiver Transmitter (UART0) */
  void* pfnUART1_Handler;                        /* 8   SAMV70N20B Universal Asynchronous Receiver Transmitter (UART1) */
  void* pvReserved9;
  void* pfnPIOA_Handler;                         /* 10  SAMV70N20B Parallel Input/Output Controller (PIOA) */
  void* pfnPIOB_Handler;                         /* 11  SAMV70N20B Parallel Input/Output Controller (PIOB) */
  void* pvReserved12;
  void* pfnUSART0_Handler;                       /* 13  SAMV70N20B Universal Synchronous Asynchronous Receiver Transmitter (USART0) */
  void* pfnUSART1_Handler;                       /* 14  SAMV70N20B Universal Synchronous Asynchronous Receiver Transmitter (USART1) */
  void* pfnUSART2_Handler;                       /* 15  SAMV70N20B Universal Synchronous Asynchronous Receiver Transmitter (USART2) */
  void* pfnPIOD_Handler;                         /* 16  SAMV70N20B Parallel Input/Output Controller (PIOD) */
  void* pvReserved17;
  void* pfnHSMCI_Handler;                        /* 18  SAMV70N20B High Speed MultiMedia Card Interface (HSMCI) */
  void* pfnTWIHS0_Handler;                       /* 19  SAMV70N20B Two-wire Interface High Speed (TWIHS0) */
  void* pfnTWIHS1_Handler;                       /* 20  SAMV70N20B Two-wire Interface High Speed (TWIHS1) */
  void* pfnSPI0_Handler;                         /* 21  SAMV70N20B Serial Peripheral Interface (SPI0) */
  void* pfnSSC_Handler;                          /* 22  SAMV70N20B Synchronous Serial Controller (SSC) */
  void* pfnTC0_Handler;                          /* 23  SAMV70N20B Timer Counter (TC0) */
  void* pfnTC1_Handler;                          /* 24  SAMV70N20B Timer Counter (TC0) */
  void* pfnTC2_Handler;                          /* 25  SAMV70N20B Timer Counter (TC0) */
  void* pfnTC3_Handler;                          /* 26  SAMV70N20B Timer Counter (TC1) */
  void* pfnTC4_Handler;                          /* 27  SAMV70N20B Timer Counter (TC1) */
  void* pfnTC5_Handler;                          /* 28  SAMV70N20B Timer Counter (TC1) */
  void* pfnAFEC0_Handler;                        /* 29  SAMV70N20B Analog Front-End Controller (AFEC0) */
  void* pfnDACC_Handler;                         /* 30  SAMV70N20B Digital-to-Analog Converter Controller (DACC) */
  void* pfnPWM0_Handler;                         /* 31  SAMV70N20B Pulse Width Modulation Controller (PWM0) */
  void* pfnICM_Handler;                          /* 32  SAMV70N20B Integrity Check Monitor (ICM) */
  void* pfnACC_Handler;                          /* 33  SAMV70N20B Analog Comparator Controller (ACC) */
  void* pfnUSBHS_Handler;                        /* 34  SAMV70N20B USB High-Speed Interface (USBHS) */
  void* pfnMCAN0_INT0_Handler;                   /* 35  SAMV70N20B Controller Area Network (MCAN0) */
  void* pfnMCAN0_INT1_Handler;                   /* 36  SAMV70N20B Controller Area Network (MCAN0) */
  void* pfnMCAN1_INT0_Handler;                   /* 37  SAMV70N20B Controller Area Network (MCAN1) */
  void* pfnMCAN1_INT1_Handler;                   /* 38  SAMV70N20B Controller Area Network (MCAN1) */
  void* pvReserved39;
  void* pfnAFEC1_Handler;                        /* 40  SAMV70N20B Analog Front-End Controller (AFEC1) */
  void* pfnTWIHS2_Handler;                       /* 41  SAMV70N20B Two-wire Interface High Speed (TWIHS2) */
  void* pvReserved42;
  void* pfnQSPI_Handler;                         /* 43  SAMV70N20B Quad Serial Peripheral Interface (QSPI) */
  void* pfnUART2_Handler;                        /* 44  SAMV70N20B Universal Asynchronous Receiver Transmitter (UART2) */
  void* pfnUART3_Handler;                        /* 45  SAMV70N20B Universal Asynchronous Receiver Transmitter (UART3) */
  void* pfnUART4_Handler;                        /* 46  SAMV70N20B Universal Asynchronous Receiver Transmitter (UART4) */
  void* pfnTC6_Handler;                          /* 47  SAMV70N20B Timer Counter (TC2) */
  void* pfnTC7_Handler;                          /* 48  SAMV70N20B Timer Counter (TC2) */
  void* pfnTC8_Handler;                          /* 49  SAMV70N20B Timer Counter (TC2) */
  void* pfnTC9_Handler;                          /* 50  SAMV70N20B Timer Counter (TC3) */
  void* pfnTC10_Handler;                         /* 51  SAMV70N20B Timer Counter (TC3) */
  void* pfnTC11_Handler;                         /* 52  SAMV70N20B Timer Counter (TC3) */
  void* pfnMLB_Handler;                          /* 53  SAMV70N20B MediaLB (MLB)       */
  void* pvReserved54;
  void* pvReserved55;
  void* pfnAES_Handler;                          /* 56  SAMV70N20B Advanced Encryption Standard (AES) */
  void* pfnTRNG_Handler;                         /* 57  SAMV70N20B True Random Number Generator (TRNG) */
  void* pfnXDMAC_Handler;                        /* 58  SAMV70N20B Extensible DMA Controller (XDMAC) */
  void* pfnISI_Handler;                          /* 59  SAMV70N20B Image Sensor Interface (ISI) */
  void* pfnPWM1_Handler;                         /* 60  SAMV70N20B Pulse Width Modulation Controller (PWM1) */
  void* pfnFPU_Handler;                          /* 61  SAMV70N20B Floating Point Unit (FPU) */
  void* pvReserved62;
  void* pfnRSWDT_Handler;                        /* 63  SAMV70N20B Reinforced Safety Watchdog Timer (RSWDT) */
  void* pfnCCW_Handler;                          /* 64  SAMV70N20B System Control Block (SCB) */
  void* pfnCCF_Handler;                          /* 65  SAMV70N20B System Control Block (SCB) */
  void* pvReserved66;
  void* pvReserved67;
  void* pfnIXC_Handler;                          /* 68  SAMV70N20B Floating Point Unit (FPU) */
  void* pfnI2SC0_Handler;                        /* 69  SAMV70N20B Inter-IC Sound Controller (I2SC0) */
} DeviceVectors;

/* Defines for Deprecated Interrupt and Exceptions handler names */
#define pfnMemManage_Handler      pfnMemoryManagement_Handler     /**< \deprecated  Backward compatibility for ASF */
#define pfnDebugMon_Handler       pfnDebugMonitor_Handler         /**< \deprecated  Backward compatibility for ASF */
#define pfnNMI_Handler            pfnNonMaskableInt_Handler       /**< \deprecated  Backward compatibility for ASF */
#define pfnSVC_Handler            pfnSVCall_Handler               /**< \deprecated  Backward compatibility for ASF */

